In [1]:
import pandas as pd

# Pivot Tables & Crosstabulation

In [2]:
# sample dataframe

df = pd.DataFrame({
    "Employee": ["Onkar", "Amit", "Sara", "Rohit", "Neha", "Karan"],
    "Department": ["IT", "IT", "HR", "IT", "HR", "Finance"],
    "Gender": ["M", "M", "F", "M", "F", "M"],
    "Salary": [50000, 65000, 55000, 70000, 48000, 60000]
})

df

  Employee Department Gender  Salary
0    Onkar         IT      M   50000
1     Amit         IT      M   65000
2     Sara         HR      F   55000
3    Rohit         IT      M   70000
4     Neha         HR      F   48000
5    Karan    Finance      M   60000

## 1. What is a pivot table?

**A pivot table:**
- Groups data
- Aggregates values
- Presents results in a matrix form

## 2. Basic pivot table -> `.pivot_table()`

In [5]:
pd.pivot_table(
    df,
    values = "Salary",
    index = "Department",
    aggfunc = "mean"
)

                  Salary
Department
Finance     60000.000000
HR          51500.000000
IT          61666.666667

**index** -> rows  
**values** -> On which column the agg. fun have to apply  
**aggfunc** -> Aggregate function

## 3. Multiple aggregate functions

In [9]:
pd.pivot_table(
    df,
    index = "Department",
    values = "Salary",
    aggfunc = ["mean", "max", "min", "count"]
)

                    mean    max    min  count
                  Salary Salary Salary Salary
Department
Finance     60000.000000  60000  60000      1
HR          51500.000000  55000  48000      2
IT          61666.666667  70000  50000      3

## 4. Pivot with columns (2D analysis)

In [11]:
pd.pivot_table(
    df,
    index = "Department",
    values = "Salary",
    columns = "Gender",
    aggfunc = "mean"
)

Gender            F             M
Department
Finance         NaN  60000.000000
HR          51500.0           NaN
IT              NaN  61666.666667

The table have **index/rows** -> **Department**  
and **column** -> **Gender**

In [29]:
pd.pivot_table(
    df,
    values = "Salary",
    index = "Department",
    aggfunc = "mean",
    columns = ["Gender", "Employee"],
    fill_value = 0
)

Gender            F                 M
Employee       Neha     Sara     Amit    Karan    Onkar    Rohit
Department
Finance         0.0      0.0      0.0  60000.0      0.0      0.0
HR          48000.0  55000.0      0.0      0.0      0.0      0.0
IT              0.0      0.0  65000.0      0.0  50000.0  70000.0

## 5. Handling missing values in  pivot

In [12]:
pd.pivot_table(
    df,
    values = "Salary",
    index = "Department",
    columns = "Gender",
    aggfunc = "mean",
    fill_value = 0
)

Gender            F             M
Department
Finance         0.0  60000.000000
HR          51500.0      0.000000
IT              0.0  61666.666667

## 6. Multiple values in pivot

In [13]:
df["Bonus"] = df["Salary"] * 0.10

In [15]:
pd.pivot_table(
    df,
    values = ["Salary", "Bonus"],
    index = "Department",
    aggfunc = "mean"
)

                  Bonus        Salary
Department
Finance     6000.000000  60000.000000
HR          5150.000000  51500.000000
IT          6166.666667  61666.666667

In [17]:
pd.pivot_table(
    df,
    values = ["Salary", "Bonus"],
    index = "Department",
    aggfunc = "mean",
    columns = "Gender",
)

             Bonus                Salary
Gender           F            M        F             M
Department
Finance        NaN  6000.000000      NaN  60000.000000
HR          5150.0          NaN  51500.0           NaN
IT             NaN  6166.666667      NaN  61666.666667

In [18]:
pd.pivot_table(
    df,
    values = ["Salary", "Bonus"],
    index = "Department",
    aggfunc = "mean",
    columns = "Gender",
    fill_value = 0
)

             Bonus                Salary
Gender           F            M        F             M
Department
Finance        0.0  6000.000000      0.0  60000.000000
HR          5150.0     0.000000  51500.0      0.000000
IT             0.0  6166.666667      0.0  61666.666667

## 7. `pd.crosstab()` â€” Frequency Tables

How many Gender(M or F) are in Departments

In [19]:
pd.crosstab(df["Department"], df["Gender"])

Gender      F  M
Department
Finance     0  1
HR          2  0
IT          0  3

In [20]:
pd.crosstab(df["Department"], df["Salary"])

Salary      48000  50000  55000  60000  65000  70000
Department
Finance         0      0      0      1      0      0
HR              1      0      1      0      0      0
IT              0      1      0      0      1      1

## 8. Crosstab with normalization (percentages)

In [22]:
pd.crosstab(
    df["Department"],
    df["Gender"],
    normalize = "index"
)

Gender        F    M
Department
Finance     0.0  1.0
HR          1.0  0.0
IT          0.0  1.0

In [23]:
m = pd.crosstab(
    df["Department"],
    df["Gender"],
    normalize = "index"
)

# Summary

<hr>

```
pd.pivot_table(
    df,
    values = ".." / [List],
    index = "..", [List]
    columns = ".." / [List],
    aggfunc = ".." / [List]
)
```  
Groups the data and aggregate the values in a table  
1. **Parameters:**:
    1. df -> DataFrame in which the all data available
    2. values -> Values on which the aggregate function is applied
    3. index -> row or list of rows w wanted in result table
    4. columns -> column or list of column wanted in result
    5. aggfunc -> single function or list of functions to be apply on values


<hr>
<hr>

```
pd.crosstab(
    df[".."],
    df[".."],
    normalize = True / False / "index"
)
```
It makes the frequencies count of every pair occured.  
In two columns it gives **"How many times does each pair occured"**
1. **Parameters:**
    1. First column
    2. Second columns
    3. Normalize ->
        1. True -> Overall percentage
        2. "index" -> index/row wise percentage
        3. "columns" -> column wise percentage

<hr>

**Using multiple index:**

In [32]:
pd.pivot_table(
    df,
    values = "Salary",
    index = ["Department", "Gender"],
    aggfunc = ["mean", "sum", "count"]
)

                           mean     sum  count
                         Salary  Salary Salary
Department Gender
Finance    M       60000.000000   60000      1
HR         F       51500.000000  103000      2
IT         M       61666.666667  185000      3